---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarMaxLength
source: html/d25b7e3a-dae5-3753-fa74-46aca84b8692.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarMaxLength Property

"Maximum bar length"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarMaxLength { get; }
```